Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_Swift/Framework_Swift-level1_source3.tmx
Source language: en_us
Languages: ja

source: Use this initializer to create a string by converting an MLDataValue with an underlying type of String.
ja: このイニシャライザを使って文字列を作成してください、MLDataValueをある基礎をなす型のStringで変換することによって

source: Use this initializer to explicitly convert other to an UnsafeMutableRawPointer instance.
ja: このイニシャライザを使って、otherをUnsafeMutableRawPointerインスタンスに明示的に変換してください。

source: Use this initializer to explicitly convert other to an UnsafeRawPointer instance.
ja: このイニシャライザを使って、otherをUnsafeRawPointerインスタンスに明示的に変換してください。

source: Use this method to calculate the full result of a product that would otherwise overflow.
ja: このメソッドを使うことで、そうしなければオーバーフローするであろう積の完全な結果を計算してください。

source: Use this method to calculate the quotient and remainder of a division at the same time.
ja: このメソッドを使って、除算の商と余りを同時に計算してください。

source: Use this method to generate an integer within a specific range when you are using a custom random number generator.
ja: このメソッドを使って、あなたがあつらえの無作為数生成子を使っている場合に、特定の範囲の内のある整数を作成してください。

source: Use this method to generate an integer within a specific range.
ja: このメソッドを使って、特定の範囲の内のある整数を作成してください。

source: Use this method to receive a sequence of non-optional values when your transformation produces an optional value.
ja: このメソッドを使うことで非オプショナル値のシーケンスを受け取ってください、あなたの変換がオプショナル値を生成する時に。

source: Use this method to receive a single-level asynchronous sequence when your transformation produces an asynchronous sequence for each element.
ja: このメソッドを使って、単一階層の非同期シーケンスを受け取ってください、あなたの変換が各要素に対してひとつの非同期シーケンスを生み出す時は。

source: Use this method to receive a single-level collection when your transformation produces a sequence or collection for each element.
ja: あなたの変換が各要素に対してひとつのシーケンスまたはコレクションを生成する場合に、このメソッドを使って単一水準コレクションを受け取ってください。

source: Use this method to receive a single-level sequence when your transformation produces a sequence or collection for each element.
ja: あなたの変換が各要素に対してひとつのシーケンスまたはコレクションを生成する場合に、このメソッドを使って単一水準シーケンスを受け取ってください。

source: Use this method to receive an array of non-optional values when your transformation produces an optional value.
ja: このメソッドを使うことで非オプショナル値の配列を受け取ってください、あなたの変換がオプショナル値を生成する時に。

source: Use this method to receive an array of nonoptional values when your transformation produces an optional value.
ja: あなたの変換がオプショナル値を生成する場合に、このメソッドを使って非オプショナル値からなる配列を受け取ってください。

source: Use this method to remove every element in a collection that meets particular criteria.
ja: このメソッドを使って、コレクションの中の、特定の基準に合うすべての要素を除去してください。

source: Use this method when the asynchronous sequence’s values don’t conform to Comparable, or when you want to apply a custom ordering to the sequence.
ja: このメソッドを、非同期シーケンスのもつ値それらがComparableに準拠しない時に、またはあなたがあるあつらえの順序付けをそのシーケンスに適用したい時に使ってください。

source: Use this method when you have a buffer of memory bound to one type and you need to access that memory as a buffer of another type.
ja: このメソッドを使うのは、あなたがある型に束縛されるメモリのバッファを持つ、そしてあなたがそのメモリに別の型のバッファとしてアクセスする必要がある場合です。

source: Use this method when you have a pointer to memory bound to one type and you need to access that memory as instances of another type.
ja: このメソッドを、あなたがある型に束縛されたメモリへのポインタを持つ、そしてあなたがそのメモリに別の型のインスタンスとしてアクセスする必要がある場合に使ってください。

source: Use this method when you have a raw pointer to memory that has already been bound to the specified type.
ja: あなたがすでに指定された型へ束縛されているメモリに対する生のポインタを持つ場合に、このメソッドを使ってください。

source: Use this method when you need random binary data to generate another value.
ja: このメソッドを、あなたが無作為バイナリデータを別の値を生成するために必要とする場合に使ってください。

source: Use this operator to append the elements of a sequence to the end of range-replaceable collection with same Element type.
ja: この演算子を使って、あるシーケンスに属するいくらかの要素を同じElement型を持つ範囲置換可能なコレクションの終わりに加えてください。

source: Use this property to access the Unicode properties of a Unicode scalar value.
ja: このプロパティを使って、あるユニコードスカラー値のユニコードプロパティにアクセスしてください。

source: Use this value to estimate how much additional capacity will be needed for the interpolated segments.
ja: この値を使って、どのくらい多くそれ以上の容量が補間される文節に対して必要とされるか見積もってください。

source: Use typed pointers and buffers to access memory as instances of a specific type.
ja: 型付きのポインタとバッファを使って、メモリに特定の型のインスタンスとしてアクセスします。

source: Use wrappers, indices, and iterators in operations like slicing, flattening, and reversing a collection.
ja: ラッパー、インデックス、そしてイテレータを、コレクションのスライス（切出し）、平坦化、反転のような演算で使用します。

source: Use your custom types in operations that depend on testing for equality or order and as members of sets and dictionaries.
ja: あなたのあつらえの型を、同等性や順番を調べることに基づく演算の中で、そして集合および辞書のメンバとして使用します。

source: Using Objective-C Runtime Features in Swift
ja: Objective-Cランタイム機能をSwiftで使用する

source: Using a Slice instance with a mutable collection requires that the base collection’s subscript(_: Index) setter does not invalidate indices.
ja: Sliceインスタンスを可変コレクションで使うことは、基底コレクションのもつsubscript(_: Index)セッターがインデックスを無効にしないことを必要とします。

source: Using a String as a Data Value
ja: 文字列をデータ値として使う

source: Using a negative value as rhs is the same as performing a left shift using abs(rhs).
ja: rhsとして負の値を使うことは、abs(rhs)を使って左シフトを実行するのと同じです。

source: Using a negative value as rhs is the same as performing a right shift with abs(rhs).
ja: 負の値をrhsとして使うことは、abs(rhs)を使って右シフトを実行するのと同じです。

source: Using a negative value for rhs performs a left shift using abs(rhs).
ja: rhsに負の値を使うことは、abs(rhs)を使って左シフトを実行します。

source: Using a negative value for rhs performs a right shift using abs(rhs).
ja: rhsに負の値を使うことは、abs(rhs)を使って右シフトを実行します。

source: Using a value for rhs that is greater than or equal to the bit width of lhs is an overshift, resulting in zero.
ja: rhsにlhsのビット幅より大きいか等しい値を使うことは、オーバーシフト、ゼロという結果になります。

source: Using a value for rhs that is greater than or equal to the bit width of lhs is an overshift.
ja: rhsにlhsのビット幅より大きいか等しい値を使うことは、オーバーシフトです。

source: Using any other value for rhs performs a left shift on lhs by that amount.
ja: rhsに何か他の値を使うことは、左シフトをlhs上でその量だけ行います。

source: Using any other value for rhs performs a right shift on lhs by that amount.
ja: rhsに何か他の値を使うことは、右シフトをlhs上でその量だけ行います。

source: Using the forEach method is distinct from a for-in loop in two important ways:
ja: forEachメソッドを使うことは、for-inループとは２つの重要なやり方においてまったく異なります：

source: Using the prefix(through:) method is equivalent to using a partial closed range as the collection’s subscript.
ja: prefix(through:)メソッドを使うことは、部分的な完結範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the prefix(upTo:) method is equivalent to using a partial half-open range as the collection’s subscript.
ja: prefix(upTo:)メソッドを使うことは、部分的な半開範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the return statement in the body closure will exit only from the current call to body, not from any outer scope, and won’t skip subsequent calls.
ja: return文をbodyクロージャにおいて使うことは、ただ現在のbodyへの呼び出しから抜け出すだけです、全く外側のスコープからではなくて、そして続いて起こる呼び出しを飛ばしません。

source: Using the suffix(from:) method is equivalent to using a partial range from the index as the collection’s subscript.
ja: suffix(from:)メソッドを使うことは、インデックスからの部分的範囲をコレクションのもつ添え字として使うことと同等です。

source: Using the trackpad, firmly press the watch face to put the face in edit mode, then tap Customize.
ja: トラックパッドを使って、しっかりウォッチフェイスを押して、フェイスを編集モードに入れて、それからCustomizeをタップしてください。

source: Using this initializer is equivalent to initializing a string with an empty string literal.
ja: このイニシャライザを使うことは、ある文字列を空の文字列リテラルで初期化するのと等しいです。

source: Using this method with types that have a noninteger Stride may result in an approximation.
ja: このメソッドを非整数Strideを持つ型とともに使うことは、近似値という結果になるかもしれません。

source: Using this property directly is discouraged.
ja: このプロパティを直接に使うことは、推奨されません。

source: Valid indices consist of the position of every element and a “past the end” position that’s not valid for use as a subscript argument.
ja: 有効なインデックスは、各要素の位置、および添え字引数として使うのに有効でない“終わりを過ぎた”位置から成ります。

source: Valid types for ExtendedGraphemeClusterLiteralType are Character, String, and StaticString.
ja: ExtendedGraphemeClusterLiteralTypeに対して有効な型は、Character、String、そしてStaticStringです。

source: Valid types for StringLiteralType are String and StaticString.
ja: StringLiteralTypeに対する有効な型は、StringとStaticStringです。

source: Valid types for UnicodeScalarLiteralType are Unicode.Scalar, Character, String, and StaticString.
ja: UnicodeScalarLiteralTypeに対する有効な型は、Unicode.Scalar、Character、String、そしてStaticStringです。

source: Value Literals
ja: 値リテラル

source: Values and Collections
ja: 値とコレクション

source: Values in interpolations are converted to strings, and then passed to that initializer just like any other string literal.
ja: 補間の中の値は文字列に変換されます、そしてそれからそのイニシャライザに渡されます、ちょうど何か他の文字列リテラルのように。

source: Variation selectors allow rendering engines that support them to choose different glyphs to display for a particular code point.
ja: 異字体セレクタそれらは、レンダリングエンジンがそれらをサポートすることで種々の字体を選んで特定のコード点に対して表示することを可能にします。

source: Void Type
ja: void型

source: WARNING: this initializer is not memory-safe!
ja: 警告：このイニシャライザはメモリ安全ではありません！

source: Wait and collect all group child task completions:
ja: 全てのグループ子タスク完了を待って収集します：

source: Wait for all remaining tasks in the task group to complete before returning.
ja: 復帰する前にタスクグループの中の残っているタスクの全てが完了するのを待機します。

source: Wait for the next child task to complete, and return a result containing either the value that the child task returned or the error that it threw.
ja: 次の子タスクが完了するのを待機します、そして子タスクが返した値またはそれがスローしたエラーのどちらかを含んでいる値を返します。

source: Wait for the next child task to complete, and return the value it returned or rethrow the error it threw.
ja: 次の子タスクが完了するのを待ちます、そしてそれが返した値を返します、またはそれがスローしたエラーを再スローします。

source: Wait for the next child task to complete, and return the value it returned.
ja: 次の子タスクが完了するのを待機します、そしてそれが返した値を返します。

source: Wait for the task to complete, returning (or throwing) its result.
ja: タスクが完了するのを待ちます、それの結果を返します（またはスローします）。

source: Wait for the task to complete, returning its result.
ja: タスクが完了するのを待ちます、それの結果を返します。

source: Warning
ja: 警告

source: Warning: All buffer elements must be initialized before calling this.
ja: 警告：全てのバッファ要素はこれを呼び出す前に初期化されなければなりません。

source: Watch the session to see the process step by step, and then compare the two projects to see the differences.
ja: この過程を段階的に理解するためにセッションを視聴してください、そしてそれから２つのプロジェクトを比べてその違いを見てください。

source: When letters.reduce(into:_:) is called, the following steps occur:
ja: letters.reduce(into:_:)が呼び出される時、以下の段階が生じます：

source: When numbers.reduce(_:_:) is called, the following steps occur:
ja: numbers.reduce(_:_:)が呼び出される時、以下の段階が生じます：

source: When pointee is used as the left side of an assignment, the instance must be initialized or this pointer’s Pointee type must be a trivial type.
ja: pointeeが代入の左側として使われる場合、インスタンスは初期化されなければなりません、またポインタのもつPointee型は自明型でなければなりません。

source: When U+200C ZERO WIDTH NON-JOINER is inserted between two characters, it directs the rendering engine to render them separately/disconnected when it might otherwise render them as a ligature.
ja: U+200C ZERO WIDTH NON-JOINER（ゼロ幅非接合子）が２つの文字の間に挿入される時、それはレンダリングエンジンにそれらを個別に／分離して描写するよう指図します、それがそうでなければそれらを合字として描出するかもしれない時に。

source: When U+200D ZERO WIDTH JOINER is inserted between two characters, it directs the rendering engine to render them as a connected glyph when it would otherwise render them independently.
ja: U+200D ZERO WIDTH JOINER（ゼロ幅接合子）が２つの文字の間に挿入される時、それはレンダリングエンジンにそれらをある結合される字体として描写するように指図します、それがそうでなければそれらを独立して描出するであろう時に。

source: When a literal expression is written with no type information, Swift uses these type aliases to determine what type to use for the expression.
ja: リテラル表現が型情報なしで記述される時、Swiftはこれらの型エイリアスを使ってどの型をその式に使うか決定します。

source: When a string’s contiguous storage fills up, a new buffer must be allocated and data must be moved to the new storage.
ja: ある文字列の隣接ストレージがいっぱいになるとき、新しいストレージが割り当てられる必要があり、データは新しいストレージに移動される必要があります。

source: When calling a function or method with an UnsafeMutablePointer parameter, you can pass an instance of that specific pointer type or use Swift’s implicit bridging to pass a compatible pointer.
ja: 関数やメソッドをUnsafeMutablePointerパラメータとともに呼び出すとき、あなたはその特定のポインタ型のインスタンスを渡すか、またはSwiftの暗黙的ブリッジを使って互換ポインタを渡すことが可能です。

source: When calling a function or method with an UnsafeMutableRawPointer parameter, you can pass an instance of that specific pointer type, pass an instance of a compatible pointer type, or use Swift’s implicit bridging to pass a compatible pointer.
ja: 関数やメソッドをUnsafeMutableRawPointerパラメータとともに呼び出すとき、あなたはその特定のポインタ型のインスタンスを渡す、互換ポインタ型のインスタンスを渡す、またはSwiftの暗黙的ブリッジを使って互換ポインタを渡すことが可能です。

source: When calling a function or method with an UnsafePointer parameter, you can pass an instance of that specific pointer type, pass an instance of a compatible pointer type, or use Swift’s implicit bridging to pass a compatible pointer.
ja: 関数やメソッドをUnsafePointerパラメータとともに呼び出すとき、あなたはその特定のポインタ型のインスタンスを渡す、互換ポインタ型のインスタンスを渡す、またはSwiftの暗黙的ブリッジを使って互換ポインタを渡すことが可能です。

source: When calling a function or method with an UnsafeRawPointer parameter, you can pass an instance of that specific pointer type, pass an instance of a compatible pointer type, or use Swift’s implicit bridging to pass a compatible pointer.
ja: 関数やメソッドをUnsafeRawPointerパラメータとともに呼び出すとき、あなたはその特定のポインタ型のインスタンスを渡す、互換ポインタ型のインスタンスを渡す、またはSwiftの暗黙的ブリッジを使って互換ポインタを渡すことが可能です。

source: When calling a function that takes a C function pointer argument, you can pass a top-level Swift function, a closure literal, a closure declared with the @convention(c) attribute, or nil.
ja: C関数ポインタ引数を取る関数を呼び出す場合、あなたはトップレベルスウィフト関数、クロージャリテラル、@convention(c)属性で宣言されるクロージャ、またはnilを渡すことができます。

source: When calling a function that takes a pointer as a parameter, you can use implicit casting to pass a compatible pointer type or implicit bridging to pass a pointer to a variable or the contents of an array.
ja: ポインタをパラメータとして取る関数を呼び出す場合、あなたは、暗黙的なキャストを使って互換性のあるポインタ型を渡すか、暗黙的なブリッジを使ってポインタを変数または配列の内容に渡すことができます。

source: When calling the initialize(from:) method on a buffer b, the memory referenced by b must be uninitialized or the Element type must be a trivial type.
ja: initialize(from:)メソッドをバッファb上で呼び出す場合、bによって参照されるメモリは未初期化でなければなりません、またはElement型が自明型でなければなりません。

source: When calling the initializeMemory(as:from:) method on a buffer b, the memory referenced by b must be uninitialized or initialized to a trivial type, and must be properly aligned for accessing S.Element.
ja: initializeMemory(as:from:)メソッドをバッファb上で呼び出す場合、bによって参照されるメモリは未初期化であるか自明型に初期化される必要があります、そしてS.Elementにアクセスするために適切にアラインされなければなりません。

source: When declaring a function or method, you don’t need to specify a return type if no value will be returned.
ja: 関数またはメソッドを宣言するとき、値が返されることがないならばあなたは戻り型を指定する必要はありません。

source: When multiple calls are awaiting a produced value from next any call to yield will resume all awaiting calls to next with that value.
ja: 複数の呼び出しがある生成値を次の何らかの呼び出しから生み出されるのを待っている時、全ての待機している次への呼び出しをその値で再開します。

source: When reading from memory as raw bytes when that memory is bound to a type, you must ensure that you satisfy any alignment requirements.
ja: メモリから読み出しをそのメモリがある型に束縛される時に生のバイトとして行う場合、あなたがあらゆるアライメント要件を満たすことを確実にしなければなりません。

source: When reading from or writing to memory as raw bytes when that memory is bound to a type, you must ensure that you satisfy any alignment requirements.
ja: メモリから読み出しや書き込みをそのメモリがある型に束縛される時に生のバイトとして行う場合、あなたがあらゆるアライメント要件を満たすことを確実にしなければなりません。

source: When reading from the pointee property, the instance referenced by this pointer must already be initialized.
ja: pointeeプロパティから読み出している時、このポインタによって参照されるインスタンスは既に初期化されていなければなりません。

source: When the forceASCII parameter is true, a Unicode.Scalar instance with a value greater than 127 is represented using an escaped numeric value; otherwise, non-ASCII characters are represented using their typical string value.
ja: forceASCIIパラメータがtrueである場合、127より大きい値をもつUnicode.Scalarインスタンスはエスケープされた数的な値を使って表されます、そうでなければ、非ASCIIはそれらの典型的な文字列値を使って表されます。

source: When the bit width of T (the type of source) is equal to or greater than this type’s bit width, the result is the truncated least-significant bits of source.
ja: T（sourceの型）のビット幅がこの型のもつビット幅と等しいかより大きいならば、結果はsourceの先端を切った最下位ビットです。

source: When the bit width of T is less than this type’s bit width, the result is sign-extended to fill the remaining bits.
ja: Tのビット幅がこの型のもつビット幅より小さいならば、結果は残りのビットを満たすように符号拡張されます。

source: When the return value is false, the value of i is equal to limit.
ja: 戻り値がfalseの場合、iの値はlimitに等しいです。

source: When the sequence is exhausted, the accumulating value is returned to the caller.
ja: シーケンスが使い尽くされる時、蓄積値が呼び出し側へ返されます。

source: When the sequence is exhausted, the last value returned from the closure is returned to the caller.
ja: シーケンスが使い尽くされる時、クロージャから返される最後の値が呼び出し側へ返されます。

source: When the subscript is used as the left side of an assignment, the memory at p + i must be initialized or the pointer’s Pointee type must be a trivial type.
ja: 添え字が代入の左側で使われる場合、p + iでのメモリは初期化されなければなりません、またポインタのもつPointee型は自明型でなければなりません。

source: When the value is 5, the closure throws MyError, terminating the sequence.
ja: 値が5である場合、クロージャはMyErrorをスローして、シーケンスを終端しています。

source: When used to access the elements of the flag string itself, however, the secondCodeUnit index does not correspond to the position of a specific character.
ja: flag文字列それ自身の要素へのアクセスに使われる場合は、しかしながら、secondCodeUnitインデックスは特定の文字の位置に該当しません。

source: When you access memory through an UnsafeMutablePointer instance, the Pointee type must be consistent with the bound type of the memory.
ja: あなたがメモリにUnsafeMutablePointerインスタンスを通してアクセスする時、Pointee型はそのメモリの束縛される型と一致しなければなりません。

source: When you access memory through an UnsafePointer instance, the Pointee type must be consistent with the bound type of the memory.
ja: あなたがメモリにUnsafePointerインスタンスを通してアクセスする時、Pointee 型はそのメモリの束縛される型と一致しなければなりません。

source: When you add to or subtract from a raw pointer, the result is a new raw pointer offset by that number of bytes.
ja: あなたが生のポインタに加算または減算する時、結果はそのバイト数をオフセットした（補った、埋め合わせた）新しい生のポインタです。

source: When you add to or subtract from an UnsafeMutablePointer instance, the result is a new pointer of the same type, offset by that number of instances of the Pointee type.
ja: あなたがUnsafeMutablePointerインスタンスに加えたりそれから引いたりする場合、結果は同じ型の新しいポインタです、Pointee型のインスタンスの数によってオフセットします。

source: When you add to or subtract from an UnsafePointer instance, the result is a new pointer of the same type, offset by that number of instances of the Pointee type.
ja: あなたがUnsafePointerインスタンスに加えたりそれから引いたりする場合、結果は同じ型の新しいポインタです、Pointee型のインスタンスの数によってオフセットします。

source: When you allocate memory, always remember to deallocate once you’re finished.
ja: あなたがメモリをアロケートする場合、あなたがやり終えるやいなやデアロケートするのを常に忘れないでください。

source: When you call a C function using a String, Swift automatically creates a buffer of UTF-8 code units and passes a pointer to that buffer.
ja: あなたがC関数をStringを使って呼び出すとき、Swiftは自動的にUTF-8コード単位のバッファを作成してポインタをそのバッファへ渡します。

source: When you call a function that is declared as taking an AutoreleasingUnsafeMutablePointer<Type>, you can pass any of the following:
ja: あなたがAutoreleasingUnsafeMutablePointer<Type>をとるように宣言される関数を呼び出す場合、あなたは以下のどれでも渡すことができます：

source: When you call a function that is declared as taking an UnsafeMutablePointer<Type> argument, you can pass any of the following:
ja: あなたがUnsafeMutablePointer<Type>引数をとるように宣言される関数を呼び出す場合、あなたは以下のどれでも渡すことができます：

source: When you call a function that is declared as taking an UnsafeMutableRawPointer argument, you can pass the same operands as UnsafeMutablePointer<Type>, but for any type as Type.
ja: あなたがUnsafeMutableRawPointer引数を取ると宣言される関数を呼び出す場合、あなたはUnsafeMutablePointer<Type>と同じ演算数を、しかしTypeであるあらゆる型に対して、渡すことができます。

source: When you call a function that is declared as taking an UnsafePointer<Type> argument, you can pass any of the following:
ja: あなたがUnsafePointer<Type>引数をとるように宣言される関数を呼び出す場合、あなたは以下のどれでも渡すことができます：

source: When you call a function that takes an UnsafeRawPointer argument, you can pass the same operands as UnsafePointer<Type>, but with any type as Type.
ja: あなたがUnsafeRawPointer引数を取る関数を呼び出す場合、あなたはUnsafePointer<Type>と同じ演算数を、しかしTypeであるあらゆる型で、渡すことができます。

source: When you create a slice of a string, a Substring instance is the result.
ja: あなたがある文字列のスライスを作成している場合、Substringインスタンスが結果です。

source: When you enumerate a collection, the integer part of each pair is a counter for the enumeration, but is not necessarily the index of the paired value.
ja: あなたがあるコレクションを列挙するとき、各ペアの整数部分は列挙のためのカウンタです、しかし必ずしもペアにされた値のインデックスではありません。

source: When you generate random values, shuffle a collection, or perform another operation that depends on random data, this type is the generator used by default.
ja: あなたが無作為値を生成する、コレクションをシャッフルする、または無作為データに依存する他の操作を実行する場合、この型は省略時に使われる生成子です。

source: When you need a range that includes the last element of a collection, use the half-open range operator (..<) with endIndex.
ja: あなたがコレクションの最後の要素を含むある範囲を必要とする時は、半開範囲演算子（..<）をendIndexとともに使ってください。

source: When you need to check whether your collection is empty, use the isEmpty property instead of checking that the count property is equal to zero.
ja: あなたのコレクションが空かどうか確認する必要がある場合、isEmptyプロパティを使ってください、countプロパティがゼロと等しいのを調べるのではなく。

source: When you need to know the length of a string, you must first consider what you’ll use the length for.
ja: あなたがある文字列の長さを知る必要がある場合、あなたが最初に考えなければならないのは、あなたが使う長さは何に対するものかということです。

source: When you need to permanently rebind memory to a different type, first obtain a raw pointer to the memory and then call the bindMemory(to:capacity:) method on the raw pointer.
ja: あなたが永続的にメモリを異なる型へ再束縛する必要があるならば、まずメモリに対する生のポインタを取得して、それからbindMemory(to:capacity:)メソッドを生のポインタ上で呼び出してください。

source: When you need to store a substring or pass it to a function that requires a String instance, you can convert it to a String by using the String(_:) initializer.
ja: あなたが下位文字列を格納するまたはStringインスタンスを要求する関数にそれを渡す必要がある場合、あなたはそれをStringへとString(_:)イニシャライザを使って変換できます。

source: When you only need to temporarily access a pointer’s memory as a different type, use the withMemoryRebound(to:capacity:) method.
ja: あなたがポインタのもつメモリに異なる型として一時的にアクセスする必要があるだけならば、withMemoryRebound(to:capacity:)メソッドを使ってください。

source: When you pass true as isRepairing, this method replaces ill-formed sequences with the Unicode replacement character ("\u{FFFD}"); otherwise, an ill-formed sequence causes this method to stop decoding and return nil.
ja: あなたがtrueをisRepairingとして渡すとき、このメソッドは誤形式シーケンスをユニコード代替文字（"\u{FFFD}"）で置き換えます；そうでなければ、ある誤形式シーケンスはこのメソッドがエンコードを停止してnilを返すことを引き起こします。

source: When you use this type, you become partially responsible for keeping the object alive.
ja: あなたがこの型を使う場合、あなたはオブジェクト存続を保っていることに対して部分的に責任を負うようになります。

source: When you want to sort a collection of elements that don’t conform to the Comparable protocol, pass a closure to this method that returns true when the first element should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるコレクションをソートしたい場合、最初の要素が２番目の前に並べられるべき場合はtrueを返すクロージャをこのメソッドに渡してください。

source: When you want to sort a sequence of elements that don’t conform to the Comparable protocol, pass a predicate to this method that returns true when the first element should be ordered before the second.
ja: あなたがComparableプロトコルに準拠しない要素からなるシーケンスをソートしたい場合、最初の要素が２番目の前に並べられるべき時はtrueを返す述部をこのメソッドに渡してください。

source: Whether the encountered value was null.
ja: 出くわした値がnullだったかどうか。

source: Whether this function has any effect is task-dependent.
ja: この関数が何らかの効果を与えるかどうかはタスク依存です。

source: While the system generator is automatically seeded and thread-safe on every platform, the cryptographic quality of the stream of random data produced by the generator may vary.
ja: システム生成子が全てのプラットホーム上で自動的にシードを決められてスレッド安全である一方で、生成子によって生み出される無作為データのストリームの暗号化品質は様々でしょう。

source: Windows uses BCryptGenRandom.
ja: Windowsは、BCryptGenRandomを使います。

source: With a custom interpolation type, each interpolated segment is translated into a call to a special appendInterpolation method.
ja: あるあつらえの補間型では、それぞれの補間される文節は特別なappendInterpolationメソッドへの呼び出しに翻訳されます。
